Revit 2027 API
ExporterIFC.PushTransform Method
 Sets the internal transform of the exporter to process the geometry and properties of the input element.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void PushTransform(
	Transform trf
)
Public Sub PushTransform (
	trf As Transform
)
public:
void PushTransform(
	Transform^ trf
)
member PushTransform :
        trf : Transform -> unit
Parameters
trf Transform
 The transform.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExporterIFC Class
Autodesk.Revit.DB.IFC Namespace